{"version": "20250605", "ksis": [{"id": "KSI-CNA", "text": "A secure cloud service offering will use cloud native architecture and design principles to enforce and enhance the Confidentiality, Integrity and Availability of the system.", "name": "Cloud Native Architecture", "reqs": [{"id": 1, "text": "Configure ALL information resources to limit inbound and outbound traffic"}, {"id": 2, "text": "Design systems to minimize the attack surface and minimize lateral movement if compromised"}, {"id": 3, "text": "Use logical networking and related capabilities to enforce traffic flow controls"}, {"id": 4, "text": "Use immutable infrastructure with strictly defined functionality and privileges by default"}, {"id": 5, "text": "Have denial of service protection"}, {"id": 6, "text": "Design systems for high availability and rapid recovery"}, {"id": 7, "text": "Ensure cloud-native information resources are implemented based on host provider’s best practices and documented guidance"}]}, {"id": "KSI-SVC", "text": "A secure cloud service offering will follow FedRAMP encryption policies, continuously verify information resource integrity, and restrict access to third-party information resources.", "name": "Service Configuration", "reqs": [{"id": 1, "text": "Harden and review network and system configurations"}, {"id": 2, "text": "Encrypt or otherwise secure network traffic"}, {"id": 3, "text": "Encrypt all federal and sensitive information at rest"}, {"id": 4, "text": "Manage configuration centrally"}, {"id": 5, "text": "Enforce system and information resource integrity through cryptographic means"}, {"id": 6, "text": "Use automated key management systems to manage, protect, and regularly rotate digital keys and certificates"}, {"id": 7, "text": "Use a consistent, risk-informed approach for applying security patches"}]}, {"id": "KSI-IAM", "text": "A secure cloud service offering will protect user data, control access, and apply zero trust principles.", "name": "Identity and Access Management", "reqs": [{"id": 1, "text": "Enforce multi-factor authentication (MFA) using methods that are difficult to intercept or impersonate (phishing-resistant MFA) for all user authentication"}, {"id": 2, "text": "Use secure passwordless methods for user authentication and authorization when feasible, otherwise enforce strong passwords with MFA"}, {"id": 3, "text": "Enforce appropriately secure authentication methods for non-user accounts and services"}, {"id": 4, "text": "Use a least-privileged, role and attribute-based, and just-in-time security authorization model for all user and non-user accounts and services"}, {"id": 5, "text": "Apply zero trust design principles"}, {"id": 6, "text": "Automatically disable or otherwise secure accounts with privileged access in response to suspicious activity"}]}, {"id": "KSI-MLA", "text": "A secure cloud service offering will monitor, log, and audit all important events, activity, and changes.", "name": "Monitoring, Logging, and Auditing", "reqs": [{"id": 1, "text": "Operate a Security Information and Event Management (SIEM) or similar system(s) for centralized, tamper-resistent logging of events, activities, and changes"}, {"id": 2, "text": "Regularly review and audit logs"}, {"id": 3, "text": "Rapidly detect and remediate or mitigate vulnerabilities"}, {"id": 4, "text": "Perform authenticated vulnerability scanning on information resources"}, {"id": 5, "text": "Perform Infrastructure as Code and configuration evaluation and testing"}, {"id": 6, "text": "Centrally track and prioritize the mitigation and/or remediation of identified vulnerabilities"}]}, {"id": "KSI-CMT", "text": "A secure cloud service provider will ensure that all system changes are properly documented and configuration baselines are updated accordingly.", "name": "Change Management", "reqs": [{"id": 1, "text": "Log and monitor system modifications"}, {"id": 2, "text": "Execute changes though redeployment of version controlled immutable resources rather than direct modification wherever possible"}, {"id": 3, "text": "Implement automated testing and validation of changes prior to deployment"}, {"id": 4, "text": "Have a documented change management procedure"}, {"id": 5, "text": "Evaluate the risk and potential impact of any change"}]}, {"id": "KSI-PIY", "text": "A secure cloud service offering will have intentional, organized, universal guidance for how every information resource, including personnel, is secured.", "name": "Policy and Inventory", "reqs": [{"id": 1, "text": "Have an up-to-date information resource inventory or code defining all deployed assets, software, and services"}, {"id": 2, "text": "Have policies outlining the security objectives of all information resources"}, {"id": 3, "text": "Maintain a vulnerability disclosure program"}, {"id": 4, "text": "Build security considerations into the Software Development Lifecycle and align with CISA Secure By Design principles"}, {"id": 5, "text": "Document methods used to evaluate information resource implementations"}, {"id": 6, "text": "Have a dedicated staff and budget for security with executive support, commensurate with the size, complexity, scope, and risk of the service offering"}, {"id": 7, "text": "Document risk management decisions for software supply chain security"}]}, {"id": "KSI-TPR", "text": "A secure cloud service offering will understand, monitor, and manage supply chain risks from third-party information resources.", "name": "Third-Party Information Resources", "reqs": [{"id": 1, "text": "Identify all third-party information resources"}, {"id": 2, "text": "Regularly confirm that services handling federal information or are likely to impact the confidentiality, integrity, or availability of federal information are FedRAMP authorized and securely configured"}, {"id": 3, "text": "Identify and prioritize mitigation of potential supply chain risks"}, {"id": 4, "text": "Monitor third party software information resources for upstream vulnerabilities, with contractual notification requirements or active monitoring services"}]}, {"id": "KSI-CED", "text": "A secure cloud service provider will continuously educate their employees on cybersecurity measures, testing them regularly to ensure their knowledge is satisfactory.", "name": "Cybersecurity Education", "reqs": [{"id": 1, "text": "Ensure all employees receive security awareness training"}, {"id": 2, "text": "Require role-specific training for high risk roles, including at least roles with privileged access"}]}, {"id": "KSI-RPL", "text": "A secure cloud service offering will define, maintain, and test incident response plan(s) and recovery capabilities to ensure minimal service disruption and data loss during incidents and contingencies.", "name": "Recovery Planning", "reqs": [{"id": 1, "text": "Define Recovery Time Objectives (RTO) and Recovery Point Objectives (RPO)"}, {"id": 2, "text": "Develop and maintain a recovery plan that aligns with the defined recovery objectives"}, {"id": 3, "text": "Perform system backups aligned with recovery objectives"}, {"id": 4, "text": "Regularly test the capability to recover from incidents and contingencies"}]}, {"id": "KSI-INR", "text": "A secure cloud service offering will document, report, and analyze security incidents to ensure regulatory compliance and continuous security improvement.", "name": "Incident Reporting", "reqs": [{"id": 1, "text": "Report incidents according to FedRAMP requirements and cloud service provider policies"}, {"id": 2, "text": "Maintain a log of incidents and periodically review past incidents for patterns or vulnerabilities"}, {"id": 3, "text": "Generate after action reports and regularly incorporate lessons learned into operations"}]}]}
